# CLI Tools
brew "git"
brew "gh"
brew "glab"
brew "zsh"
brew "swift-format"
brew "swiftlint"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Applications
cask "setapp"
cask "fork"
cask "visual-studio-code"
cask "1password"
brew "xcodes"
cask "rapidapi"
cask "proxyman"
cask "claude"
cask "db-browser-for-sqlite"
cask "ssh-config-editor"

# Fonts
cask "font-jetbrains-mono"
